{"id":176970,"date":"2020-09-22T08:53:30","date_gmt":"2020-09-22T13:53:30","guid":{"rendered":"https:\/\/mlabs.info\/?p=176970"},"modified":"2020-09-22T09:10:50","modified_gmt":"2020-09-22T14:10:50","slug":"vehicle-hesitates-to-start","status":"publish","type":"post","link":"https:\/\/mlabs.info\/vehicle-hesitates-to-start\/","title":{"rendered":"Vehicle Hesitates to Start:  Causes"},"content":{"rendered":"<p>While it may not leave you stranded, a vehicle that hesitates to start can be very concerning. There are a few reasons why your vehicle may not be starting, such as a bad starter, a bad battery, or alternator.<\/p>\n<h2>Vehicle Hesitates to Start Causes<\/h2>\n<p>Here are some of the most typical reasons your vehicle&#8217;s starter is not cranking as fast as it should be.<\/p>\n<h3>1. Bad Battery.<\/h3>\n<p><a href=\"https:\/\/mlabs.info\/wp-content\/uploads\/2019\/10\/How-to-Start-Car-in-Cold-Weather.jpg\"><img decoding=\"async\" class=\"alignnone wp-image-103699\" src=\"https:\/\/mlabs.info\/wp-content\/uploads\/2019\/10\/How-to-Start-Car-in-Cold-Weather.jpg\" alt=\"Car Hesitates to Start\" width=\"500\" height=\"296\"><\/a><\/p>\n<p>The battery is responsible for providing the voltage necessary to crank the engine over when the vehicle is not running. When the battery begins to give out, it will provide enough voltage to start the vehicle, but not enough to start it quickly. You can almost FEEL it struggling to turn the engine when this happens.<\/p>\n<p>As the battery ages its ability to provide what&#8217;s called &#8220;cranking amps &#8220;diminishes. It is most noticeable when it is cold outside.<\/p>\n<p>The battery light is a good indication that you were going down the right path with your diagnosis, but it is not guaranteed that the battery is good if it is not on.<\/p>\n<p>&nbsp;<\/p>\n<h3>2. Corroded Battery Post<\/h3>\n<p>A corroded battery post can easily create a condition where your vehicle hesitates to start. It also happens to be the easiest thing to check on this list.<\/p>\n<p>With that in mind take a look real quick and see if there&#8217;s any corrosion or battery acid on the battery cables or post. If there is, you&#8217;ll need to scrape it off. You can get a wire brush at Walmart, or you can purchase a dedicated battery post cleaner. Make sure to wear some protection over your eyes. &nbsp;Battery acid is corrosive and stings.<\/p>\n<p>A bad battery cable can also have the same exact affect. The way that you tell that the battery cable is bad is to check the voltage as it leaves the alternator, and check it again as it enters the battery. &nbsp;There&#8217;s a video below that goes into all of this in great detail.<\/p>\n<p>Make sure that the battery posts are tightened all the way too&#8230;..<\/p>\n<p>&nbsp;<\/p>\n<h3>3. Bad Alternator<\/h3>\n<figure id=\"attachment_74394\" aria-describedby=\"caption-attachment-74394\" style=\"width: 390px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/mlabs.info\/wp-content\/uploads\/2019\/06\/Bad-Alternator-Symptoms.jpeg\"><img decoding=\"async\" class=\" wp-image-74394\" src=\"https:\/\/mlabs.info\/wp-content\/uploads\/2019\/06\/Bad-Alternator-Symptoms-916x1024.jpeg\" alt=\"\" width=\"400\" height=\"447\" srcset=\"https:\/\/mlabs.info\/wp-content\/uploads\/2019\/06\/Bad-Alternator-Symptoms-916x1024.jpeg 916w, https:\/\/mlabs.info\/wp-content\/uploads\/2019\/06\/Bad-Alternator-Symptoms-268x300.jpeg 268w, https:\/\/mlabs.info\/wp-content\/uploads\/2019\/06\/Bad-Alternator-Symptoms-768x859.jpeg 768w, https:\/\/mlabs.info\/wp-content\/uploads\/2019\/06\/Bad-Alternator-Symptoms.jpeg 1242w\" sizes=\"(max-width: 400px) 100vw, 400px\" \/><\/a><figcaption id=\"caption-attachment-74394\" class=\"wp-caption-text\">A typical alternator<\/figcaption><\/figure>\n<p>A bad alternator can also cause your vehicle to hesitate to start. If it&#8217;s not charging the battery all the way, it will exist in this limbo where it&#8217;s doing the job good enough but not great.<\/p>\n<p>He can have the part store test your alternator. &nbsp;Most of them have a machine that will spin it fast enough to tell what kind of voltage is coming from it. But, that involves removing the alternator from the vehicle.<\/p>\n<p>You can test the alternator yourself pretty easy with a multimeter. Before you start the vehicle, hook a multimeter to the battery. Get the voltage number, now go ahead and start it and test it again. If it&#8217;s under 13.0 V with the vehicle started, the alternator could be bad.<\/p>\n<p>That&#8217;s a very abbreviated version of something that&#8217;s explained much better in this video:<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/ab5Kk6JkbsI\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<h3>4. Bad Starter<\/h3>\n<p>Your vehicle may be turning over slowly due to a worn starter motor. &nbsp;When you turn the key, a powerful electromagnet is activated that forces the starter gear to engage. Once this happens, the starter turns the flywheel fast enough fast enough that the engine can take over.<\/p>\n<p>Your vehicle&#8217;s starter is really a powerful electric motor. As it wears out, I won&#8217;t be able to spin fast enough anymore, and your vehicle will hesitate to start.<\/p>\n<p>It is also possible that the electrical contacts going to it are damaged or corroded.<\/p>\n<p>&nbsp;<\/p>\n<h2>Vehicle Hesitates to Start When Cold<\/h2>\n<p>If your vehicle is hesitating to start when cold, it&#8217;s usually due to the battery struggling to provide enough cold cranking amperage. &nbsp;Batteries have two amperage ratings. &nbsp;The first is cranking amps, and the second as cold cranking amperage (CCA).<\/p>\n<p>When the weather is nice outside the battery is able to provide it&#8217;s full cranking amperage. &nbsp;CCA is the number of amps that a battery can provide to the starter at 0°F for 30 seconds while maintaining 7.2 V plus. &nbsp;CCA is always a lower number.<\/p>\n<p>Your vehicle is designed to be able to start just fine with the advertised amount of cold cranking amperage. As a battery ages its ability to provide cranking amperage diminishes. &nbsp;In the summer this can go unnoticed, as the number of amps is above the CCA amperage &nbsp;But, in the winter time it&#8217;ll become a lot more obvious and a vehicle hesitate to start as the cold cranking amperage is too low.<\/p>\n<p>&nbsp;<\/p>\n<h2>Conclusion<\/h2>\n<p>This is not a definitive list of why a vehicle may hesitate to start, but it does cover all the most common reasons. &nbsp;Good luck to you repairing your vehicle.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>While it may not leave you stranded, a vehicle that hesitates to start can be very concerning. There are a few reasons why your vehicle may not be starting, such as a bad starter, a bad battery, or alternator. Vehicle Hesitates to Start Causes Here are some of the most typical reasons your vehicle&#8217;s starter &#8230; <a title=\"Vehicle Hesitates to Start:  Causes\" class=\"read-more\" href=\"https:\/\/mlabs.info\/vehicle-hesitates-to-start\/\" aria-label=\"More on Vehicle Hesitates to Start:  Causes\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"aioseo_notices":[],"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/176970"}],"collection":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/comments?post=176970"}],"version-history":[{"count":0,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/176970\/revisions"}],"wp:attachment":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/media?parent=176970"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/categories?post=176970"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/tags?post=176970"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}