{"id":373,"date":"2016-06-06T12:45:25","date_gmt":"2016-06-06T17:45:25","guid":{"rendered":"http:\/\/mlabs.info\/?p=373"},"modified":"2016-06-06T12:48:38","modified_gmt":"2016-06-06T17:48:38","slug":"should-you-replace-or-rebuild-your-transmission","status":"publish","type":"post","link":"https:\/\/mlabs.info\/should-you-replace-or-rebuild-your-transmission\/","title":{"rendered":"Should You Replace or Rebuild your Transmission?"},"content":{"rendered":"<p>It&#8217;s a question that I hear about a lot.  If you don&#8217;t feel like reading a long in depth article on the subject, the short answer is it depends on what they do to the transmission during the rebuild.<\/p>\n<h2>Rebuilt Pros:<\/h2>\n<p>The number one advantage of going with a rebuilt transmission is going to be money.  You should never pay more money for a rebuilt unit than you do for a quality rebuild.  Having the transmission built by a reputable local shop will make it easier to deal with any sort of issue if something comes up.  A rebuild is only going to be as good as the mechanic who is working on it.  A good rule of thumb is to find a shop that employs ASE trained technicians.  <a href=\"http:\/\/www.ase.com\/landing-pages\/car-owners\/find-a-repair-shop.aspx\">Use this handy locator tool from their site.<\/a><\/p>\n<p>If you decide rebuild your transmission yourself, you&#8217;re really going to save a lot of money.  Rebuild kits can be found online for pennies on the dollar compared to the price of a rebuilt unit.<\/p>\n<h2>Rebuilt Cons:<\/h2>\n<p>If you have a shop do the rebuild, you really need to make sure that you know what they are replacing.  Are they only doing the minimum to get the transmission back on the road, or are they changing all of the clutches and testing all of the other parts?   Many shops rebuild with a core system.  This means that you take your car in and they will swap it out with a customers transmission that they have previously rebuilt.  This can be a double edged sword.  While it makes your wait time shorter, you can be getting back a transmission who&#8217;s parts have significantly higher mileage than the one that was in your car.<\/p>\n<p>If you are the one doing the rebuilding there are a couple of things to really contemplate before diving in.<\/p>\n<ul>\n<ul>\n<li>Are you very mechanically inclined?  This repair is not for the faint of heart, especially when rebuilding an automatic.  Hundreds of tiny moving parts make a transmission much less intuitive than looking at an engine.  Proceed with caution.<\/li>\n<li>Can you afford to have your vehicle off of the road for an extended period of time?  If you have a backup vehicle to use that would be ideal.  If you are going to attempt to rebuild your transmission you&#8217;ll not want to feel rushed.  There is a good YouTube video for everything.  Here is an example of one such video.  It&#8217;s a 4L60-E being rebuilt.  Can you do that?  Be honest.  The last thing you want is to pull something apart and never get it back together.<\/li>\n<\/ul>\n<\/ul>\n<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/EkyPoeAcxOI\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<h2>New Transmission Pros:<\/h2>\n<p>If you are weighing the options when it comes to replacing or rebuilding your transmission, and money is no option, than it&#8217;s really hard to go wrong with a new unit.  You don&#8217;t have to worry about another part in the unit failing and putting your car right out of commission.<\/p>\n<p>If you are installing it yourself, than it becomes a matter of whether or not you are comfortable pulling your engine and\/or transmission from the vehicle.   Either way the repair is significantly easier than rebuilding.  You can bust this out in a weekend even if you don&#8217;t have a lot of automotive expertise.<\/p>\n<h2>New Transmission Cons:<\/h2>\n<p>A new transmission is significantly pricier than a rebuilt unit.  You are certainly paying for the peace of mind that comes with knowing that your transmission will provide you with years of trouble free service.<\/p>\n<h2>Extra Thoughts on Replacing or Rebuilding a Transmission<\/h2>\n<ul>\n<li>Safety:  If you decide to do it yourself it truly is not a simple job.  Be safe!  At the least have someone to work with you to help you manipulate the thing.  Also, get the right tools for the job.  A good transmission jack can be very helpful in helping you keep your head from getting squashed.<\/li>\n<li>Junker Factor:  If you have a ten year old with 200k on it, it&#8217;d be a real shame to send it to the salvage yard with  a brand new, extremely low mile, transmission.<\/li>\n<li>Since this site is mostly about the <a href=\"http:\/\/mlabs.info\/\">700R4<\/a> and <a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/\">GM automatic transmissions<\/a>, these transmissions were all meant for rear wheel drive vehicles and are not that difficult to pull and replace.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>It&#8217;s a question that I hear about a lot.  If you don&#8217;t feel like reading a long in depth article on the subject, the short answer is it depends on what they do to the transmission during the rebuild. Rebuilt Pros: The number one advantage of going with a rebuilt transmission is going to be &#8230; <a title=\"Should You Replace or Rebuild your Transmission?\" class=\"read-more\" href=\"https:\/\/mlabs.info\/should-you-replace-or-rebuild-your-transmission\/\" aria-label=\"More on Should You Replace or Rebuild your Transmission?\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3,2],"tags":[],"aioseo_notices":[],"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/373"}],"collection":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/comments?post=373"}],"version-history":[{"count":0,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/373\/revisions"}],"wp:attachment":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/media?parent=373"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/categories?post=373"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/tags?post=373"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}