{"id":408,"date":"2016-07-01T10:34:35","date_gmt":"2016-07-01T15:34:35","guid":{"rendered":"http:\/\/mlabs.info\/?p=408"},"modified":"2020-06-02T11:31:36","modified_gmt":"2020-06-02T16:31:36","slug":"ls-engine-swap-transmission-guide","status":"publish","type":"post","link":"https:\/\/mlabs.info\/ls-engine-swap-transmission-guide\/","title":{"rendered":"LS Engine Swap Transmission Guide"},"content":{"rendered":"<p>Are you&nbsp;considering doing the<strong> LS swap<\/strong>? &nbsp;It takes a lot of work to do it right, but it&#8217;s incredibly rewarding. &nbsp;I&#8217;ve done this swap and there are really two important parts to the game plan. &nbsp;The first is to make sure that you have a game plan for all of the challenge areas. &nbsp;Deciding what to do about the transmission can be one of the most challenging aspects.<\/p>\n<p>That&#8217;s where this guide comes in. &nbsp;You&#8217;ll see each area of opportunity. &nbsp;Once you have figured you&#8217;ll be one step closer to completing your swap. &nbsp;If you have a vehicle that this has been done to a lot you&#8217;ll have no problem here.<\/p>\n<p>You&#8217;ll want to look at every The great news is that it is on the internet for you to take and use. &nbsp;If you &nbsp;Why do the swap?<\/p>\n<ul>\n<li><strong>Reliability<\/strong>&#8211; &nbsp;The LS Series of engines are bulletproof. &nbsp;You&#8217;ll see guys throw insane turbos into the basic 5.3 truck engine and dip into the 10&#8217;s.<\/li>\n<li><strong>Power<\/strong>&#8211; &nbsp;The LR4 4.8L truck engine is the smallest of the Vortec series of engines. &nbsp;It makes almost 300 horsepower at the rear wheels of a pickup truck. &nbsp;This power is low in the throttle curve and is extremely street-able. &nbsp;The big block Chevy&#8217;s or LT-1&#8217;s of yesteryear depended almost entirely on camshaft to achieve the power that the engineers were after. &nbsp;Today, the Gen IV LS engines have heads that outflow anything that came before them.<\/li>\n<li><strong>Tuning-<\/strong> &nbsp;No more messing with Jetting a carb, or getting the timing curve just right.<\/li>\n<\/ul>\n<p>But, what about the transmission? &nbsp;People often neglect this when they consider what kind of engine they are going to use.<\/p>\n<p>&nbsp;<\/p>\n<h2>Common transmission choices for the LS swap<\/h2>\n<p>For the purposes of this guide, we will stick with the concept of adapting GM transmissions with the LS Series of engines. &nbsp;There certainly are ways of going about adapting these engines to a foreign drivetrain though, so don&#8217;t lose heart.<\/p>\n<p><strong><a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/4l60-e\/\">4L60E<\/a><\/strong>&#8211; &nbsp;These transmission were standard behind most of the Vortec truck motors. &nbsp;This transmission will be great with your swap since it is what these motors were meant to work with. &nbsp;Make sure that if you buy it separate from the engine that you know for sure that you have an automatic wiring harness. &nbsp;If you have a manual harness most shops don&#8217;t like reworking them into automatic harnesses. &nbsp;You&#8217;ll have a bad time&nbsp;trying to get someone to do this for you.<\/p>\n<p><strong>The 4L60E has been around a lot longer than the LS motors<\/strong>, so try and find one that goes with your year motor. &nbsp;I recommend&nbsp;getting the transmission from the same pullout that you found the engine in. &nbsp;This will make it a thousand times easier. Here is a video worth watching if you are going to try and buy one that did not come with the engine. It really goes into identifying them properly. There are a lot of ins and outs.<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/An2tp8uo3Fs\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p>&nbsp;<\/p>\n<p><strong>4L80E<\/strong> &#8211; &nbsp;This transmission is pretty much the same at the 4L60E above. &nbsp;As the TH400 is to the TH350, this transmission is the heavy duty equivalent here. &nbsp;If you get one at a good price, you&#8217;ll have an incredibly bulletproof transmission that&#8217;ll handle almost anything that you can throw at it. &nbsp;Here is the catch, it has a larger case. &nbsp;Many older muscle cars will need to have transmission tunnel modifications done in order to accommodate the larger case. &nbsp;Keep that in mind. &nbsp;I have a Nova, and didn&#8217;t want to mess with that.<\/p>\n<p><strong>T56 Transmission<\/strong>&#8211; &nbsp;These came behind many LS Series cars. &nbsp;You&#8217;ll find them in the 4&#8217;th generation F-body twins, CTS-V Caddilac, and Pontiac GTO. &nbsp;These are all useful behind the LS motors, although you&#8217;ll more than likely want to relocate the shifter. &nbsp;This is espescially true when it comes to the CTS, which has a linkage system instead of the shifter directly on top.<\/p>\n<p>You&#8217;ll really want to avoid the Corvette T56. &nbsp;Most people reading this will understand that the Corvette T56 is attached to a transaxle and not really the same transmission at all. &nbsp;I am mentioning this because they go pretty cheap in the salvage community because they can only really be used on the Corvette. &nbsp;It is 100% not worth it.<\/p>\n<p>Also, avoid the T56 that came behind the LT1 engine. &nbsp;The geometry is entirely different than it&#8217;s LS counterpart. &nbsp;It is basically incompatible. &nbsp;I&#8217;ve seen people change the input shaft and make it work. &nbsp;If that sounds like something that you can do you can do than don&#8217;t let my words slow you down. &nbsp;For everyone else just avoid it.<\/p>\n<p>It is also worth noting that this transmission is HUGE. &nbsp;It&#8217;s not going into a muscle car without a fight. &nbsp;It is a monster. &nbsp;It does bolt right up<\/p>\n<p><strong>Tremec TKO\/Muncie<\/strong>&#8211; &nbsp;Bolting these transmissions up to an LS series engine is not straightforward, but has it&#8217;s benefits. &nbsp;GM did everyone a &nbsp;huge favor by keeping the same bolt pattern. &nbsp;This makes it technically possible to bolt these transmissions together, otherwise this wouldn&#8217;t be an option for your LS engine swap. &nbsp;In the classic car community this pretty much makes it as good as done. &nbsp;You will run into a couple of issues with this.<\/p>\n<p>The first is&nbsp;&nbsp;geometry issues. &nbsp;The distance between the flywheel and throwout bearing is different. &nbsp;So you&#8217;ll either need to get a special flywheel( McLeod sells on), or you can use a one off truck flywheel&nbsp;that GM made. &nbsp;It seems to work. &nbsp;Check out this video and see if it is for you. &nbsp;These guys are great.<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/RCGl5HbrUeE\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p>You&#8217;ll also need to have all of the transmission codes deleted from the ECU if you use a Muncie.<\/p>\n<p>There are few good reasons to consider this. &nbsp;The first would be clearance. &nbsp;The Muncie is significantly smaller than a T56. &nbsp;The difference is insane. &nbsp;The TKO is quite a bit smaller itself. &nbsp;The second would be cost. &nbsp;If you have a perfectly good Muncie sitting in the car maybe you have no desire to run an overdrive transmission. &nbsp;There&#8217;s nothing wrong with that!<\/p>\n<p><strong><a href=\"http:\/\/mlabs.info\/\">700R4<\/a>\/<a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/2004r\/\">2004R<\/a>&nbsp;twins<\/strong>&#8211; &nbsp;If you own a GM car from the 80&#8217;s you may still have a good 700R4 sitting in there. &nbsp;As far as gearing goes they are identical. &nbsp;The cases are a similar size as well. &nbsp; You&#8217;ll need a flexplate adapter. &nbsp;They go for under $40 at Amazon.<\/p>\n<p><a href=\"https:\/\/www.amazon.com\/gp\/product\/B007WWSR1S\/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B007WWSR1S&amp;linkCode=as2&amp;tag=700r4hq-20&amp;linkId=f360daee640ab02cfa1c6812180ffe6a\" target=\"_blank\" rel=\"noopener noreferrer\">JEGS Performance Products 601010 Crankshaft Spacer Adapts: GM LS1 LS2 LS3 LS6 LS7 L92 To: Pre-1997 TH350 TH400 700-R4 4L60 4L60E 4L85E<\/a><img decoding=\"async\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-na.amazon-adsystem.com\/e\/ir?t=700r4hq-20&amp;l=am2&amp;o=1&amp;a=B007WWSR1S\" alt=\"\" width=\"1\" height=\"1\" border=\"0\"><\/p>\n<figure id=\"attachment_418\" aria-describedby=\"caption-attachment-418\" style=\"width: 216px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/LS-Swap-Flexplate-Adapter.jpg\"><img decoding=\"async\" class=\"size-full wp-image-418\" src=\"http:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/LS-Swap-Flexplate-Adapter.jpg\" alt=\"LS Swap Transmission Adapter\" width=\"226\" height=\"203\" srcset=\"https:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/LS-Swap-Flexplate-Adapter.jpg 226w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/LS-Swap-Flexplate-Adapter-100x90.jpg 100w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/LS-Swap-Flexplate-Adapter-150x135.jpg 150w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/LS-Swap-Flexplate-Adapter-200x180.jpg 200w\" sizes=\"(max-width: 226px) 100vw, 226px\" \/><\/a><figcaption id=\"caption-attachment-418\" class=\"wp-caption-text\">Chevrolet Performance 12563532K<\/figcaption><\/figure>\n<p>You&#8217;ll also need something to attach the TV cable to. &nbsp;If you have a manual throttle body intake( drive by throttle cable, not electronic) you&#8217;ll need something to connect your TV cable to the throttle blades.<\/p>\n<figure id=\"attachment_420\" aria-describedby=\"caption-attachment-420\" style=\"width: 219px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/TV-Cable-adapter.jpg\"><img decoding=\"async\" class=\"wp-image-420\" src=\"http:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/TV-Cable-adapter.jpg\" alt=\"LS Swap TV-Cable Adapter\" width=\"229\" height=\"223\" srcset=\"https:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/TV-Cable-adapter.jpg 304w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/TV-Cable-adapter-300x292.jpg 300w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/TV-Cable-adapter-100x97.jpg 100w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/TV-Cable-adapter-150x146.jpg 150w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/07\/TV-Cable-adapter-200x195.jpg 200w\" sizes=\"(max-width: 229px) 100vw, 229px\" \/><\/a><figcaption id=\"caption-attachment-420\" class=\"wp-caption-text\">This Adapter will allow you to use your current TV cable to run your LS1<\/figcaption><\/figure>\n<p>Now, if you have an electronic throttle body you are not stuck up the creek, but your way forward may involve a little fabrication. &nbsp;There is no moving mechanism outside of the electronic throttle body, so the only place you have to get that movement from is the actual gas pedal.<\/p>\n<p>There isn&#8217;t an aftermarket solution to this issue, so you&#8217;ll have to do a little fabrication. &nbsp;Check out this forum entry.<\/p>\n<p><a href=\"http:\/\/www.thirdgen.org\/forums\/transmissions-drivetrain\/687228-700r4-tv-cable-mounted.html\">http:\/\/www.thirdgen.org\/forums\/transmissions-drivetrain\/687228-700r4-tv-cable-mounted.html<\/a><\/p>\n<p>If you aren&#8217;t afraid of fabrication, than you&#8217;ll just need to get a bracket on the pedal.<\/p>\n<p><strong><a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/th400\/\">TH400<\/a>\/<a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/turbo-hydramatic-350\/\">TH350<\/a>\/<a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/powerglide\/\">Powerglide<\/a><\/strong>&#8211; &nbsp;These transmissions will bolt to the LS1 engine with the same flexplate adapter you&#8217;d use for the 700R4( see above). &nbsp;You&#8217;ll also need to adapt something for the kickdown cable as well. &nbsp;There are vacuum ports on the intake for the TH350.<\/p>\n<p>&nbsp;<\/p>\n<h2>Picking a motor<\/h2>\n<p>The LS engines have been around for almost 20 years now (crazy right). &nbsp;That&#8217;s good news for the everyman who wants cheap and reliable horsepower. &nbsp;You can now get a 10 year old truck engine from the salvage yard for for well under a thousand dollars. &nbsp;The thing with getting one from the salvage yard is that they don&#8217;t really adjust the price much based on mileage,<strong> so take your time and find one with less than 100k miles<\/strong>.<\/p>\n<p>Make sure that you understand the difference between a Gen III and Gen IV LS motors. &nbsp; There&#8217;s a big difference when it comes to the difficulty of the swap. &nbsp;The Gen IV blocks have displacement on demand, which lets the motor run on only four cylinders when it is not under a heavy load.<\/p>\n<p>It is much easier to deal with the Gen III motor. &nbsp;These motors include:<\/p>\n<ul>\n<li><strong>LM7<\/strong>&#8211; &nbsp;5.3L truck motor, which was produced between 1999 and 2007. &nbsp;It was rated at right around 300 horsepower except for the first year. &nbsp;It switched to electronic throttle control in the middle of production, so that&#8217;s something that you&#8217;ll have to consider. &nbsp;If you go with one that has an electric throttle body,&nbsp;make sure you get the throttle pedal with the engine, so you don&#8217;t have to find one later. &nbsp;The blocks are made of <strong>iron<\/strong>. &nbsp;Beware that you aren&#8217;t picking up an LR4. &nbsp;They look identical on the outside. &nbsp;Use the glove compartment tag to verify if the engine is still in the vehicle.<\/li>\n<li><strong>LS1<\/strong>&#8211; &nbsp;This engine came in the Camaro and Corvette in the late nineties and early 00&#8217;s. &nbsp;These are the easiest motors to swap into an early muscle car. &nbsp;They are already drive by cable, and the accessories are kept close to the engines. &nbsp;The closer the accessories are to the engine, the more wiggle room you&#8217;ll have when it comes to how to engine placement. &nbsp;This engine is made out of <strong>aluminum<\/strong>. &nbsp;To get an engine and transmission together, you&#8217;ll be looking at spending over $3000. &nbsp;These combos hold their value incredibly well. &nbsp;The Camaro pull out is the more desirable, because the Vette used a Transaxle.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are you&nbsp;considering doing the LS swap? &nbsp;It takes a lot of work to do it right, but it&#8217;s incredibly rewarding. &nbsp;I&#8217;ve done this swap and there are really two important parts to the game plan. &nbsp;The first is to make sure that you have a game plan for all of the challenge areas. &nbsp;Deciding what &#8230; <a title=\"LS Engine Swap Transmission Guide\" class=\"read-more\" href=\"https:\/\/mlabs.info\/ls-engine-swap-transmission-guide\/\" aria-label=\"More on LS Engine Swap Transmission Guide\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7,3,4],"tags":[],"aioseo_notices":[],"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/408"}],"collection":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/comments?post=408"}],"version-history":[{"count":0,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/408\/revisions"}],"wp:attachment":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/media?parent=408"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/categories?post=408"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/tags?post=408"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}