{"id":469,"date":"2016-08-02T12:58:29","date_gmt":"2016-08-02T17:58:29","guid":{"rendered":"http:\/\/mlabs.info\/?p=469"},"modified":"2018-04-19T15:02:56","modified_gmt":"2018-04-19T20:02:56","slug":"how-to-tell-if-you-have-a-bad-neutral-safety-switch","status":"publish","type":"post","link":"https:\/\/mlabs.info\/how-to-tell-if-you-have-a-bad-neutral-safety-switch\/","title":{"rendered":"How to tell if you have a bad neutral safety switch"},"content":{"rendered":"<p>Back in the day, when you’d go to start a car it would be entirely possible for you to bump the starter and have the vehicle just take off.  This would cause damage to property, other vehicles, and even human life.  The <strong>Neutral Safety Switch<\/strong> was invented to curtail this issue.  The neutral safety switch is a switch that can be mounted anywhere that keeps the vehicle from starting in gear.  It is one of many safety features that modern cars have, and it is one that rarely ever has a problem.  A bad neutral safety switch can really be difficult to pinpoint.  This should never be your first conclusion if you are troubleshooting why your car won&#8217;t start.<\/p>\n<p>There are two different ways that a neutral safety switch can go bad.   The first way is that the switch remains on at all times.  That will cause nothing to happen when you turn the key.  The other is that the car will start in gear, which you might not even notice for a long time, since we start our cars in park or neutral as a way of habit anyway.<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"http:\/\/mlabs.info\/wp-content\/uploads\/2016\/08\/Neutral-Safety-Switch.jpg\"><img decoding=\"async\" class=\"alignnone size-full wp-image-1488\" src=\"http:\/\/mlabs.info\/wp-content\/uploads\/2016\/08\/Neutral-Safety-Switch.jpg\" alt=\"Symptoms of a Bad Neutral Safety Switch\" width=\"400\" height=\"400\" srcset=\"https:\/\/mlabs.info\/wp-content\/uploads\/2016\/08\/Neutral-Safety-Switch.jpg 400w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/08\/Neutral-Safety-Switch-150x150.jpg 150w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/08\/Neutral-Safety-Switch-300x300.jpg 300w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/08\/Neutral-Safety-Switch-100x100.jpg 100w, https:\/\/mlabs.info\/wp-content\/uploads\/2016\/08\/Neutral-Safety-Switch-200x200.jpg 200w\" sizes=\"(max-width: 400px) 100vw, 400px\" \/><\/a><\/p>\n<h4><span style=\"text-decoration: underline;\">Navigation:<\/span><\/h4>\n<p style=\"padding-left: 30px;\"><a href=\"#1\">Bad Neutral Safety Switch Symptoms<\/a><\/p>\n<p style=\"padding-left: 30px;\"><a href=\"#2\">How a Neutral Safety Switch Works<\/a><\/p>\n<p style=\"padding-left: 30px;\"><a href=\"#Help if You are Stranded with a Bad Neutral Safety Switch\">Help if You are Stranded with a Bad Neutral Safety Switch<\/a><\/p>\n<p style=\"padding-left: 30px;\"><a href=\"#What is a neutral safety switch\">What is a Neutral Safety Switch?<\/a><\/p>\n<p style=\"padding-left: 30px;\"><a href=\"#Where is the Neutral Safety Switch located\">Where is the Neutral Safety Switch located?<\/a><\/p>\n<h2 id=\"#1\">Neutral Safety Switch Symptom:  The Car Starts in any Gear<\/h2>\n<p>Well, the good news about this one is that at least you won’t be stranded anywhere.  In fact, you may only be aware of it because the service engine soon light came on.  It is still a good move to go ahead and get the Neutral Safety Switch removed.  It only takes one mistake to damage something.  A car is fully capable of starting in gear, so until you get the neutral safety switch repaired, use caution and diligence when starting the vehicle.<\/p>\n<p>&nbsp;<\/p>\n<h2>Neutral Safety Switch Symptom:  The Car Won’t Start at All<\/h2>\n<p>If you turn the key and it doesn’t feel like the starter is engaging, then you probably have a bad neutral safety switch, but not necessarily.  Let’s go over some practical troubleshooting to help verify this.<\/p>\n<ul>\n<li>Yo<strong>u turn the key and the engine doesn’t start<\/strong>, but you here one click coming from the engine when you turn the key. That clicking sound is more than likely the starter solenoid.  You probably have a bad starter motor.  It is a much more common issue than a <strong>bad neutral safety switch<\/strong>.<\/li>\n<li>Turn your headlights on. Get a friend to stand in front of the vehicle or find something reflective to let you see your lights (or turn of the light and close the garage door if you are lucky enough to be in a garage with this problem).  Now turn the key.  <strong>If the lights stay on and bright than it could be the neutral safety switch<\/strong>.  You were checking to make sure that you didn’t have a bad battery or battery connection.  If your lights did dim really bad you may wish to check and see if the battery is corroded.  Follow this YouTube tutorial to fix a corroded battery issue.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/5vWu4qIGLEw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li>Security system. <strong>Many vehicles have a security system that will activate the neutral safety switch<\/strong> in order to keep the vehicle from starting.  The security light will usually go out with all of the other lights on the dash.  If it stays on, than that may be the issue that is keeping the vehicle from starting<\/li>\n<li>Many vehicles also have a switch that only lets you start the vehicle with the brake pedal pushed in. This is not as common as a neutral safety switch, but worth looking into.<\/li>\n<li>It could be a locked engine. That will keep it from turning over.  Unless you have some reason to believe that you’ve run the motor out of oil, this is way less likely than the neutral safety switch going bad.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2 id=\"2\">How the Neutral safety switch works in a manual transmission<\/h2>\n<p>The neutral safety switch in a vehicle with a manual transmission is going to look a heck of a lot like a brake light switch.  It works in the same fashion as the brake light switch.  It will allow the vehicle to start in any gear, but it’ll only fire if the clutch is pressed in all of the way (even in neutral).<\/p>\n<p>&nbsp;<\/p>\n<h2>How the Neutral safety switch works in an automatic transmission<\/h2>\n<p>On more modern vehicles, it is often located where the shift linkage attaches to the transmission on modern vehicles.  It could also be somewhere on the column.  You’ll need to consult your repair guide or the internet (you’re already there anyway!) to find the exact location of your neutral safety switch.  The neutral safety switch allows the car or truck to start in both park and neutral.  Both of these “gears” are not really gears.  They provide neither forward or rearward momentum.<\/p>\n<p>&nbsp;<\/p>\n<h2 id=\"Help if You are Stranded with a Bad Neutral Safety Switch\">I’m Stuck with a bad neutral safety switch NOW!<\/h2>\n<p>Are you stuck somewhere and your pretty sure that you have a bad neutral safety switch?   Try this to get you out of jam so you can get home or somewhere safe to make the repair.<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li>Older Fords are notorious for needing a little help to engage the safety switch. Try lifting the column shifter higher like there is a gear above park.  At the same time you do this keep the key turned in the forward position to engage the starter if it works.  This works on a lot of vehicles.  Try this on any make of vehicle<\/li>\n<li>Keep the key toward start and rock the steering wheel back and forth. Sometimes the mechanism that keeps the vehicle in park won’t engage all the way.  This is why you should ALWAYS use your parking brake.  When you rock the wheel you’ll be settling the transmission and it may start<\/li>\n<li>Put the vehicle in Neutral. It may not work in Park, but it may work in Neutral!  Simple right?  This works a surprisingly high amount of time.<\/li>\n<li>Keep your foot firmly on the brake. Turn the key to engage the starter and shift through all of the gears.  You may very well end up engaging the Neutral Safety Switch in a gear it’s not supposed to work in.  If this works you’ll be starting the car in gear so don’t just take the foot off of the brake until you are in the gear that you need to put the transmission in.<\/li>\n<li>If you have a manual transmission keep the key turned, your foot on the brake, and the key turned forward.  You&#8217;ll want to keep pushing the clutch pushed down.  It may engage the neutral safety switch.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2 id=\"What is a neutral safety switch\">What is a neutral safety switch?<\/h2>\n<p>Simply put, <strong>a neutral safety switch is a device that keeps your car from starting when it is in gear<\/strong>.  Otherwise, if you were to bump your starter, the vehicle would move forward.  Back in the olden days before neutral safety switches were common, it wasn&#8217;t unusual to see a vehicle &#8220;run away&#8221; when somebody bumped the starter.  Clearly this presented a very real danger to people and property that was in the path of the car or truck.  That&#8217;s where the neutral safety switch came in.  It eliminated these problems:<\/p>\n<ul>\n<li>It is much more difficult (but not impossible) for the vehicle to start when it is in gear, a neutral safety switch keeps a vehicle from lurching forward into things.<\/li>\n<li>Starting in gear is bad for the starter as well as the engine mounts.  The vehicle will &#8220;buck&#8221; like a horse when the starter and transmission are engaged at the same time.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2 id=\"Where is the Neutral Safety Switch located\">Where is the neutral safety switch?<\/h2>\n<p>Where the neutral safety switch is on your vehicle is going to depend a lot upon who made the car, how old it is, and whether or not it was equipped with a manual transmission or not.<\/p>\n<h4>Automatic Transmissions<\/h4>\n<p>On most modern automatic transmission, the neutral safety switch is attached where the transmission and shift linkage connect to one another.  It&#8217;ll look like a little black box that goes right around where the shifter connects.  Manufacturers put it there so that regardless of what gear the shifter says  it&#8217;s in, the gear that the transmission is currently in will determine if the car starts.  This can save you from the car starting in gear when you have a broken shift linkage.<\/p>\n<p>On older vehicles, the neutral safety switch is wired into the column and will only let the car start when it&#8217;s in the neutral position or not.  A lot of people who put in floor shifters have had problems thinking they had a bad starter or ignition when really the column shifter nub has moved a little bit.<\/p>\n<h4>Manual Transmissions<\/h4>\n<p>The neutral safety switch on a manual transmission is going to be easy to find.  It&#8217;s a plunger type switch that lets the vehicle start when you press the clutch in.  The neutral safety switch on a manual transmission is always going to be located where the clutch pedal meets the floor.  Just look at the pedal.  It&#8217;ll be there.<\/p>\n<p>It’s not very likely that you’ll have any sort of issue with a neutral safety switch over the life of a modern car, but if you do I hope this helps.  Thanks for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Back in the day, when you’d go to start a car it would be entirely possible for you to bump the starter and have the vehicle just take off.  This would cause damage to property, other vehicles, and even human life.  The Neutral Safety Switch was invented to curtail this issue.  The neutral safety switch &#8230; <a title=\"How to tell if you have a bad neutral safety switch\" class=\"read-more\" href=\"https:\/\/mlabs.info\/how-to-tell-if-you-have-a-bad-neutral-safety-switch\/\" aria-label=\"More on How to tell if you have a bad neutral safety switch\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"aioseo_notices":[],"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/469"}],"collection":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/comments?post=469"}],"version-history":[{"count":0,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/469\/revisions"}],"wp:attachment":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/media?parent=469"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/categories?post=469"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/tags?post=469"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}