{"id":786,"date":"2017-03-16T15:10:06","date_gmt":"2017-03-16T20:10:06","guid":{"rendered":"http:\/\/mlabs.info\/?p=786"},"modified":"2018-04-19T21:42:56","modified_gmt":"2018-04-20T02:42:56","slug":"common-ls-swap-issues","status":"publish","type":"post","link":"https:\/\/mlabs.info\/common-ls-swap-issues\/","title":{"rendered":"Common LS Swap Issues"},"content":{"rendered":"<p>If you are considering swapping out your motor for an LS motor, there is a lot to consider.  It is totally doable, and absolutely worth it.  The performance and drive-ability improvements that these engines add to an older model vehicle are amazing.<\/p>\n<p>The best way to approach the swap is to think of it like a jigsaw puzzle.  There are a <strong>few key pieces that need to fit together to make a success of your effort<\/strong>.  These include engine mounts, crossmember, headers, and accessories.  They all need to work and fit together.  You&#8217;ll have a much better time swapping out your engine if you address these areas of concern <strong>before you buy any parts<\/strong>.  There are many companies out there who make parts that can make swapping an LS motor into your car a breeze, but they are going to cost more than generic parts and fabrication.<\/p>\n<p>Alternatively (and just as importantly), there&#8217;s almost certainly a post or forum out there on a forum where someone has covered every aspect of the swap in great detail.  <a href=\"http:\/\/www.ls1tech.com\">LS1tech.com<\/a> is a great place to start.  Use this information to your advantage.  If you can find a forum entry where someone has laid out every single aspect of the swap, than you are ahead of the game.  Try and replicate what they have done.  Instead of figuring out the geometry and mechanics of the swap, you can just start doing it.  You&#8217;ll save so much time.<\/p>\n<p>Hours of prep will save you weeks of delay.  It will also save you a ton of money on parts that don&#8217;t match.  With that in mind lets get into what you absolutely should know before buying any single part.  There is almost a universal truth when it comes to the LS swap, and that is that there are inexpensive parts, and they&#8217;ll work.  But, those parts are almost never vehicle specific, and vehicle specific parts cut down on the frustration and time it takes to do this swap.<\/p>\n<h2>Choosing the Engine for your LS Swap<\/h2>\n<p>There are many variations of the LS engine, and the cost for them varies wildly.  There are truck engines, and exotic supercharged aluminum versions used in the Corvette.<\/p>\n<ul>\n<li>Gen III is a bit easier to run due to the lack of <a href=\"http:\/\/www.enginebuildermag.com\/2014\/01\/the-inner-workings-of-variable-valve-timing\/\">variable valve timing<\/a>.  It&#8217;s also quite a bit cheaper than the Gen IV small-block.<\/li>\n<li>Given that the mileage and model year is the same, truck engines are significantly less expensive than the car engine.<\/li>\n<li>The truck intake manifold is not as aesthetically pleasing, it is also taller.  So, if clearance is an issue keep that in mind.<\/li>\n<li>The accessories on the truck engines are further from the block than the Camaro.  And, in turn, the Corvette has closer accessories than the Camaro.<\/li>\n<li>Some engines use drive by wire (electronic) and some use drive by cable (throttle cable).  If you go with a drive by wire you&#8217;ll be able to easily set up cruise control, but that also means modifying the throttle pedal in order to fit the vehicle.  <a href=\"http:\/\/ls1tech.com\/forums\/conversions-hybrids\/1151985-truck-dbw-pedal-modification-ideas.html\">This forum<\/a> has quite a few good examples of what this would take.  Be prepared to weld.<\/li>\n<\/ul>\n<p>I can&#8217;t stress enough how important that it is to try and get an engine <strong>as complete as possible<\/strong>.  When getting one from the salvage yard, make sure that you are getting the transmission, harness, accessories, intake, etc&#8230;  If they all come from the same pull than there is no question of whether or not they&#8217;ll work together.<\/p>\n<p>&nbsp;<\/p>\n<h3>Transmission<\/h3>\n<p>The LS engines will bolt with any of the non computer controlled &#8220;old school&#8221; transmissions.  They certainly work best with the transmissions that they were designed to run, but they&#8217;ll do just fine with say a <a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/turbo-hydramatic-350\/th350-transmission-identification\/\">TH350<\/a> or <a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/th400\/\">TH400<\/a>.  There are a few things to consider when deciding what to do about the transmission.<\/p>\n<p>We have a whole post on that <a href=\"http:\/\/mlabs.info\/ls-engine-swap-transmission-guide\/\">LS Swap Transmissions<\/a> if you would like to learn more about it.<\/p>\n<h3>Crossmember and Motor Mounts<\/h3>\n<p>This is an incredibly crucial aspect to the swap.  You can buy some inexpensive universal LS swap motor mounts on eBay or Amazon.  They may or may not work with your engine bay.  One thing that people often overlook when it comes to the swap is pinion angle.  If the <a href=\"http:\/\/www.speedwaymotors.com\/the-toolbox\/setting-proper-driveshaft-angles\/28855\">pinion angle<\/a> is off because the motor mounts are different (even if you leave the factory crossmember) the driveline is going to vibrate the car at speed, which makes the quality of ride not nearly as pleasing.<\/p>\n<h3>Fuel System<\/h3>\n<p>Most people who do this swap are swapping it into a vehicle that came from the factory with a carburetor.  LS engines want around 100 pounds of fuel pressure to properly atomize the fuel and deliver it to the cylinder.  The factory fuel lines are just not going to be able to handle that kind of pressure.   An electric fuel pump is a necessity, even if you are using a carb.   There&#8217;s inline and in tank fuel options from vendors such as Tanks Inc.  This is an area that can really blow out the budget.  You can spend about $100 to get the basic setup, or full blown EFI tank with pump and lines is going to be $700.<\/p>\n<h3>Headers and Exhaust Manifolds<\/h3>\n<p>The stock <strong>exhaust manifolds<\/strong> that came with the engine itself are usually fine for most applications.  You&#8217;ll find that the LS1 (and car motors in general) manifolds stay closer to the block than the truck engine&#8217;s manifolds, which makes them fit in more applications.  If you are swapping in a truck engine than it may be necessary to use a Camaro\/Vette manifold on the steering box side.  <strong>Headers<\/strong> can be tricky.  They really should be considered with the motor mounts.<\/p>\n<h3>Wiring<\/h3>\n<p>There are two aspects to the wiring that must be addressed.  The first one is the <strong>wiring harness itself<\/strong>.  There are plenty of youtube videos and online tutorials that&#8217;ll help get the wiring harness straightened out.  The best source for this is lt1swap.com.  Here is a link to the best page to start.<\/p>\n<p><a href=\"http:\/\/lt1swap.com\/wiringharness.htm\">http:\/\/lt1swap.com\/wiringharness.htm<\/a><\/p>\n<p>If the prospect of removing all of those pins and wiring seems a little to much (I always farm this part out), I recommend sending off for a rework.  There are plenty of people on eBay who provide this service for $100 or so. Here is a video that shows what is involved. This guy has some great videos for a swapper to watch.<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/tITS_uOXZrU?ecver=1\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p>&nbsp;<\/p>\n<p>The second thing is the <strong>ECM<\/strong>.  It has to be reprogrammed.  There are security measures associated with it where it can&#8217;t just be plugged in and run.  The anti-theft system must be deleted.<\/p>\n<p>Unlike the wiring, which you can do yourself, the ECM is going to need to be shipped out to be reprogrammed.  Odds are you can find someone in your area who will do it for you on the cheap.  Otherwise you can check eBay.  People are always auctioning off rewiring\/reprogramming services on there.  The going rate is around $60.  This will get the ECM ready to run a stock motor with no modifications.  The tuners can remove the active torque management as well, if it&#8217;s a drive by wire setup.<\/p>\n<p>If the engine in question is getting a camshaft that &#8220;requires tuning&#8221; than you&#8217;re going to have to send off for a special programing to make it run properly with it.    Alternatively if you live in a major metropolitan area there should be a local speed shop to handle it for you.  As far as the mail in tunes go, black bear is the best there is.  Check them out<\/p>\n<p><a href=\"http:\/\/www.blackbearperformance.com\">blackbearperformance.com<\/a><\/p>\n<h3>Cooling System<\/h3>\n<p>The LS engine runs pretty cool, so most factory radiators can handle the heat generated by it.  Now, there is one thing that must be addressed.  The steam vent tube.  Some people block it off or don&#8217;t know what to do with it.  It needs to be run to the radiator, or back to a radiator hose.  Those are your two options.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you are considering swapping out your motor for an LS motor, there is a lot to consider.  It is totally doable, and absolutely worth it.  The performance and drive-ability improvements that these engines add to an older model vehicle are amazing. The best way to approach the swap is to think of it like &#8230; <a title=\"Common LS Swap Issues\" class=\"read-more\" href=\"https:\/\/mlabs.info\/common-ls-swap-issues\/\" aria-label=\"More on Common LS Swap Issues\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[],"aioseo_notices":[],"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/786"}],"collection":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/comments?post=786"}],"version-history":[{"count":0,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/786\/revisions"}],"wp:attachment":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/media?parent=786"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/categories?post=786"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/tags?post=786"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}