{"id":857,"date":"2017-04-21T15:20:18","date_gmt":"2017-04-21T20:20:18","guid":{"rendered":"http:\/\/mlabs.info\/?p=857"},"modified":"2018-04-19T21:43:19","modified_gmt":"2018-04-20T02:43:19","slug":"signs-of-torque-converter-problems","status":"publish","type":"post","link":"https:\/\/mlabs.info\/signs-of-torque-converter-problems\/","title":{"rendered":"Signs of Torque Converter Problems"},"content":{"rendered":"<p>The torque converter is responsible for converting the energy generated by the engine at the flywheel and transferring it to an automatic transmission.  It functions in the same place in the driveline as a clutch would, creating a bridge between the engine and the transmission.  When they go bad, they have the potential to leave you stranded.   Understanding them certainly can keep you from being stranded on the side of the road.   So let&#8217;s go over common <strong>torque converter problems<\/strong>.<\/p>\n<p>The biggest difference between a torque converter and a clutch is how they transfer the energy between the flywheel (what a clutch connects to) or the flex plate (what a automatic transmission connects to).  The clutch will slip using physical friction between the clutch disk and flywheel.  The torque converters hydraulic connection builds pressure as rpm increases.  This is worth noting because it&#8217;s important to understand how something works to properly diagnose and fix it.  Here is more on exactly how a torque converter works if you are so inclined:<\/p>\n<p><a href=\"https:\/\/www.mistertransmission.com\/how-does-a-torque-converter-work\/\">https:\/\/www.mistertransmission.com\/how-does-a-torque-converter-work\/<\/a><\/p>\n<h2>Causes of Torque Converter Problems<\/h2>\n<p>There are many different things that can cause torque converter problems.<\/p>\n<ul>\n<li><span style=\"color: #ff0000;\">Low or Dirty fluid<\/span>&#8211;  Transmission fluid is the lifeblood of the transmission and the torque converter bolted to it.  If there isn&#8217;t enough it can&#8217;t do its job.  This  will in turn cause the transmission to overheat.  This is one of the most common causes of torque converter problems.  If the transmission fluid is dirty and old it won&#8217;t be able to do its job as a hydraulic fluid as well.  This can lead to a feeling of extra slipping and chattering at speed.  Make sure you take a <strong>look at the fluid before you do anything<\/strong> with your transmission.  If you don&#8217;t know or can&#8217;t remember the last time it was changed or serviced this would be the place to start.<\/li>\n<li><span style=\"color: #ff0000;\">Worn Clutches<\/span>&#8211;  The clutch that locks the transmission to the engine at highway speed can wear out just like a normal manual transmission clutch.<\/li>\n<li><span style=\"color: #ff0000;\">Bad Seals<\/span>&#8211;  This is one of the most common issues that causes a torque converter to go bad.  It&#8217;s usually pretty detectable, as there will be a pool of fluid beneath the bellhousing.<\/li>\n<li><span style=\"color: #ff0000;\">Loose Torque Converter Bolts<\/span>&#8211;  This will create the same symptoms as the bad seals in that the converter is going to puke a bunch of ATF all over your garage floor, but you should also be feeling quite the vibration at speed.  If you suspect this could be what is going on with your transmission, just know that if those bolts come all the way out the least that is going to happen is that it disengages from the input shaft.  Most likely it&#8217;s going to really do some real damage to the crank and input shaft.<\/li>\n<\/ul>\n<h2>Faulty Torque Converter Diagnosis<\/h2>\n<p>Above we laid out the issues that cause a torque converter to go bad. Here we are going to discuss what it actually feels like in your vehicle.  Before diagnosing any transmission issue, you&#8217;ll want to drive to let the engine warm up to its normal operating temperature.  This will ensure that the transmission is shifting as it would nearly all the time that it normally operates.<\/p>\n<p>After you&#8217;ve let the transmission warm up turn the radio off and roll the windows up.  You&#8217;re going to want to pay maximum attention to what&#8217;s going on with both the engine and transmission.  Pay particular attention to any shuddering and vibration as you accelerate.  Shuddering and vibration are in no way a guarantee that something is wrong with the torque converter.  I&#8217;ve outlined a few examples of other things that could be wrong if there is a vibration below.<\/p>\n<p>A common issue that happens with front wheel drive cars is that the axle shafts (or cv shafts) go bad.  This can create a similar vibration, but it will get worse or only exist when you go around corners.  Below are signs that will tell you if the torque converter is damaged or going out:<\/p>\n<ul>\n<li><a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/transmission-slipping\/\">Slipping Transmission<\/a> at low speed-  The torque converter &#8220;stall speed&#8221; is the speed that the engine needs to be turning before the torque converter will begin engaging the transmission.  When a torque converter is malfunctioning it can cause this stall speed to change and feel like the transmission is slipping.  If you suspect this is happening with your car, has your fuel mileage changed?  This iso fen a sign that the transmission isn&#8217;t operating efficiently.<\/li>\n<li><span style=\"color: #ff0000;\">Slipping at highway speed<\/span>&#8211;  Nearly all modern automatic transmissions have what is called a locking converter.  This type of  torque converter has been the standard since the mid eighties, and is universally used today.  What it does is have  clutches in it that let the transmission make a physical connection with the engine.  This eliminates all operating inefficiency when it is at high speed (usually after about 45 miles an hour).  This increases the fuel mileage achieved and brings an automatic transmissions efficiency more in line with a standard transmission.<\/li>\n<li><span style=\"color: #ff0000;\">Chattering or vibration<\/span>&#8211;  If you feel a vibration going down the road it could very well be the torque converter.  The fluid level may not be where it needs to be.  Have you ever had an uneven load in the washer?  It spins around and the washer sounds like it is beating itself to death.  The torque converter is the same way when it can&#8217;t spin the right amount of fluid through itself.  It is way less likely, but the bolts that hold the torque converter to the flex plate can come loose and cause a vibration at speed.<\/li>\n<\/ul>\n<h2>Repair the Converter ASAP<\/h2>\n<p>A torque converter has the potential to keep on going for months after it first starts to go out.  But, when it does, it&#8217;ll blow out and toast the transmission.  It&#8217;ll rain debris and metal destroying it almost instantly.  Don&#8217;t put it off.  If you aren&#8217;t sure, take it to a garage and have it looked after.  Putting it off is going to cost you big money and is dangerous.<\/p>\n<p>&nbsp;<\/p>\n<h2>Cost to Replace a Torque Converter<\/h2>\n<p>&nbsp;<\/p>\n<p>If you are positive that you have a bad torque converter, than replacing it is a must.  Torque converter replacement cost is going to depend a lot on what type of vehicle you are driving.  In general, a front wheel drive vehicle is going to be more expensive from a labor point of view and could cost anywhere between $300-$1000 depending on the vehicle.<\/p>\n<p><a href=\"http:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions.jpg\"><img decoding=\"async\" class=\"alignnone wp-image-864\" src=\"http:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions.jpg\" alt=\"Torque Converter Problems\" width=\"617\" height=\"517\" srcset=\"https:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions.jpg 940w, https:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions-300x251.jpg 300w, https:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions-768x644.jpg 768w, https:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions-100x84.jpg 100w, https:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions-150x126.jpg 150w, https:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions-200x168.jpg 200w, https:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions-450x377.jpg 450w, https:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions-600x503.jpg 600w, https:\/\/mlabs.info\/wp-content\/uploads\/2017\/04\/Tourque-Converter-Problems-and-Solutions-900x754.jpg 900w\" sizes=\"(max-width: 617px) 100vw, 617px\" \/><\/a><\/p>\n<p>If you are going to attempt to replace the problematic torque converter yourself, than you certainly are going to be saving yourself tons of money.  If the vehicle that you are attempting to fix is front wheel drive, than it&#8217;ll be more difficult to do than a rear wheel drive.  This is due to the transmission location.  99% of the battle is just getting to the converter.  After that it&#8217;s a pretty simple fix.  Just a few bolts, slide the converter off of the input shaft, and tighten it back down.  If you&#8217;ve never done this before try and start at the beginning of the weekend to give yourself plenty of time and you can save yourself a ton of money.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The torque converter is responsible for converting the energy generated by the engine at the flywheel and transferring it to an automatic transmission.  It functions in the same place in the driveline as a clutch would, creating a bridge between the engine and the transmission.  When they go bad, they have the potential to leave &#8230; <a title=\"Signs of Torque Converter Problems\" class=\"read-more\" href=\"https:\/\/mlabs.info\/signs-of-torque-converter-problems\/\" aria-label=\"More on Signs of Torque Converter Problems\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"aioseo_notices":[],"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/857"}],"collection":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/comments?post=857"}],"version-history":[{"count":0,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/posts\/857\/revisions"}],"wp:attachment":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/media?parent=857"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/categories?post=857"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/tags?post=857"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}