{"id":11,"date":"2014-04-05T18:38:42","date_gmt":"2014-04-05T23:38:42","guid":{"rendered":"http:\/\/mlabs.info\/?page_id=11"},"modified":"2020-06-11T09:06:50","modified_gmt":"2020-06-11T14:06:50","slug":"700r4","status":"publish","type":"page","link":"https:\/\/mlabs.info\/","title":{"rendered":"700R4"},"content":{"rendered":"<p>The TH700R4 transmission was designed to replace the&nbsp;TH350 transmission. &nbsp;It is a <a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/\">GM automatic transmission<\/a> designed for rear wheel drive vehicles. &nbsp;GM was feeling the pressure to produce more fuel efficient cars from both the government and consumers, the latter&nbsp;were just starting to discover the reliability and fuel savings that Japanese auto makers were offering. &nbsp;The <a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/2004r\/\">2004R <\/a>and 700R4 allowed the heavier Detroit iron to not look embarrassingly inefficient next to their new rivals. &nbsp;It&nbsp;made it&#8217;s debut in the 1982 model year. &nbsp;If you want to learn more about the differences is the <a href=\"http:\/\/mlabs.info\/2004r-vs-700r4-differences\/\">2004R vs 700R4<\/a>, just check that article out.<\/p>\n<p>While it is not computer controlled, it does use a TV Cable, which acts like a throttle position sensor to control when and how hard it shifts. Most people concede that the first 5 or so years the transmission was pretty weak. &nbsp;It was much improved by the 1988 model year. &nbsp;If going to look for one in the salvage yard, try and look for an example newer than 88&#8242;. &nbsp;The C4 Corvette uses a special shorter version, so be aware of that when going to seek one out. &nbsp;Also keep in mind that the case is larger than a TH350, so if room is at a premium look to the 2004R.<\/p>\n<figure id=\"attachment_38\" aria-describedby=\"caption-attachment-38\" style=\"width: 422px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/mlabs.info\/wp-content\/uploads\/2014\/04\/Home-Pic.jpg\" rel=\"attachment wp-att-38\"><img decoding=\"async\" class=\" wp-image-38\" src=\"http:\/\/mlabs.info\/wp-content\/uploads\/2014\/04\/Home-Pic.jpg\" alt=\"700r4 transmission\" width=\"432\" height=\"277\" srcset=\"https:\/\/mlabs.info\/wp-content\/uploads\/2014\/04\/Home-Pic.jpg 1506w, https:\/\/mlabs.info\/wp-content\/uploads\/2014\/04\/Home-Pic-300x192.jpg 300w, https:\/\/mlabs.info\/wp-content\/uploads\/2014\/04\/Home-Pic-1024x657.jpg 1024w\" sizes=\"(max-width: 432px) 100vw, 432px\" \/><\/a><figcaption id=\"caption-attachment-38\" class=\"wp-caption-text\"><strong>700R4<\/strong><\/figcaption><\/figure>\n<p>It is often still a favorite choice of many car enthusiasts due to its reliability, relative inexpensiveness, and the fuel savings afforded by the overdrive gear. &nbsp; In 1990 it was re-branded 4L60 and remained in common use through 1992.<\/p>\n<p>Although similar to today’s modern <a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/4l60e-identification\/\">4L60E<\/a> they cannot be easily exchanged for one another. &nbsp; The reason for this is because it works with the engines computer in tandem with the engine to provide consistent shifting that is well suited to any speed and throttle load situation.&nbsp; The 700R4, on the other hand is told when to shift by&nbsp;the aforementioned&nbsp;“TV cable”.&nbsp; This cable hooks directly to the carburetor or throttle body. &nbsp;The ECM is a tremendous improvement over the TV Cable, which itself is a tremendous improvement over the kick down and vacuum modulator found on a <a href=\"http:\/\/mlabs.info\/gm-automatic-transmissions\/turbo-hydramatic-350\/\">TH350<\/a>.<\/p>\n<h2>700R4&nbsp;Gear Ratios<\/h2>\n<table style=\"height: 162px;\" width=\"474\">\n<tbody>\n<tr>\n<td width=\"259\"><strong>Reverse<\/strong><\/td>\n<td width=\"257\"><strong>First Gear Ratio<\/strong><\/td>\n<td width=\"258\"><strong>Second Gear Ratio<\/strong><\/td>\n<td width=\"257\"><strong>Third Gear Ratio<\/strong><\/td>\n<td width=\"269\"><strong>Fourth Gear\/Overdrive<\/strong><\/td>\n<\/tr>\n<tr>\n<td width=\"259\"><strong>2.30<\/strong><\/td>\n<td width=\"257\"><strong>3.06<\/strong><\/td>\n<td width=\"258\"><strong>1.63<\/strong><\/td>\n<td width=\"257\"><strong>1.00<\/strong><\/td>\n<td width=\"269\"><strong>0.70<\/strong><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h2>Fluid Capacity<\/h2>\n<p>The thing with fluid capacity is that it is not constant for every application. &nbsp;But as a rule the 700r4 holds about 11 Quarts. &nbsp;If it is a high capacity version it could hold up to 12 quarts, and if it has a transmission cooler attached that&#8217;s good for at least another quart.<\/p>\n<h2>TV Cable Adjustment<\/h2>\n<p>Adjusting the TV cable is a relatively easy process that allows you to change the shift points of your vehicle. &nbsp;It will fix a 700R4 that has really firm shifts, or shifts that feel to sluggish. It is important to make sure that this cable is in adjustment. &nbsp;A transmission that is not shifting properly will wear out faster than you&#8217;d like. &nbsp;dThe TV cable is a very easy thing to adjust. &nbsp;There is a little semi-circle looking button that you press in. &nbsp;You&#8217;ll than be able to adjust it from there. &nbsp;It&#8217;s a pretty straight forward process. &nbsp;I think <a href=\"http:\/\/home.windstream.net\/mcfly\/tv_cable.htm\">this write<\/a> up is a phenomenal resource on adjusting a TV cable.<\/p>\n<p>&nbsp;<\/p>\n<h2>TH350 to 700R4 conversion<\/h2>\n<p>The swap is relatively straightforward. You will need to do just a few things. The 700R4 is 24” from bell housing to tail shaft with a 6” tail shaft. The TH350 is 22 1\/4 “ from the bell housing to the tail shaft, with 3” 6” and 9” tail shafts available. Most of the time you’ll have to have the driveshaft shortened. The transmission mount location on the 700R4 is also a few inches further back (21.25” vs 19.5” with the TH350) so a new crossmember or some fabrication will be required. The TH350 uses a kick down cable. It is not the same as the The next order of business will be to adjust install and adjust the TV Cable, which is no way the same as a kick down cable. The TH700R4 uses a switch attached to the brake pedal to disengage the locking torque converter. You’ll need to wire it up. Most people utilize a switch attached to the brake pedal like the stock cars that the 700R4 came with. It’s a pretty simple process. After that, just fill it with fluid and you’re golden.<\/p>\n<ul>\n<li>You will need to shorten the driveshaft regardless of whether or not you have the Corvette version or the standard length 700R4.<\/li>\n<li>They both us the same output shaft so you do not need to get a new one.<\/li>\n<li>You must get a NEW torque converter for the swap.&nbsp; The 700R4 uses a locking converter which is not interchangeable.&nbsp; By locking the torque converter it&nbsp;makes a direct connection between the engine and transmission much in the same way that a&nbsp;manual transmission would going down the highway.<\/li>\n<li>You can look forward to roughly 30% better fuel economy.<\/li>\n<li>You will need to hook up the converter lock wiring.<\/li>\n<\/ul>\n<p>If you are using this on an LS swap you should note:<\/p>\n<ul>\n<li>There is a bolt hole that is on Gen I and II small block Chevys that is not on generations III and IV.&nbsp; This does not cause any issues.<\/li>\n<li>You will need to have the ECU re flashed in order to remove the shift tables.&nbsp; You will also have extra wiring on your harness.<\/li>\n<li>You will need to fabricate or order a specific bracket to make the TV cable compatible with the engine. &nbsp;Most people either hook it to the gas pedal, or if it&#8217;s drive by cable, they will hook it to the throttle arm on the throttle body.<\/li>\n<li>You may need to modify or create the locking converter wiring.<\/li>\n<\/ul>\n<h2>How to buy a 700R4<\/h2>\n<p><strong>Salvage yard:&nbsp; (good for budget and lower horsepower applications)<\/strong><\/p>\n<ul>\n<li><strong>The advantages:<\/strong>&nbsp; It is easier to get an idea of the kind of life that the transmission may have had before coming into your life.&nbsp; You can evaluate the vehicle that it was in and glean important information such as mileage of the vehicle before it met its end.&nbsp; Although a good 700R4 is getting harder to find in the salvage yard it is still possible to find one.&nbsp; A good rule of thumb is to look for a vehicle that came in due to a non-driveline related death.&nbsp; I.E.&nbsp; It may have been sideswiped or incurred some form of mild damage that rendered the vehicle structurally sound, yet unusable by the owner.<\/li>\n<\/ul>\n<ul>\n<li><strong>The Disadvantages<\/strong>:&nbsp; The 700R4 has been out of production for quite a long time.&nbsp; So, it’s going to be a lot more difficult to find than a 4L60E.&nbsp; Even though you are going to know vehicle that it came from, that vehicle is still going to be at least 20 years old.&nbsp; Be careful, and make sure that the salvage yard guarantees it to work.&nbsp; At the minimum they should have guarantee that if the transmission does not work that you can bring it back and swap it out for another unit free of charge.&nbsp; Keep in mind that these guys are not going to pay you for your labor in<\/li>\n<\/ul>\n<p><strong>Craigslist:&nbsp; The great crapshoot.<\/strong><\/p>\n<ul>\n<li><strong>The advantages:<\/strong>&nbsp; Everyone is familiar with the online classified site.&nbsp; You can often find a deal that is better than better than what the local speed shop or even the internet can offer for a freshened up unit.&nbsp; Many people have rebuilt units that they never got into putting in their car.&nbsp; Also, many people are doing the LS motor\/4L60E swap you can find so many people are unloading perfectly good units.<\/li>\n<\/ul>\n<ul>\n<li><strong>The disadvantages:<\/strong>&nbsp; It’s Craigslist.&nbsp; Be careful whenever you go to meet somebody.&nbsp; Use common sense.&nbsp; Make sure that you are in public when you do the transaction whenever possible.&nbsp; There is a McDonalds close to virtually anywhere.&nbsp; They have a pretty good guide at&nbsp;<a href=\"http:\/\/www.craigslist.org\/about\/safety\">http:\/\/www.craigslist.org\/about\/safety<\/a>.&nbsp; It is important to note that it can be more difficult getting your money back or a new transmission if you buy from an individual.<\/li>\n<\/ul>\n<p><strong>Online:&nbsp; Easy, safe and getting more cost effective.<\/strong><\/p>\n<ul>\n<li><strong>Advantages:&nbsp;<\/strong>&nbsp;There are many reputable shops selling online.&nbsp; A great place to look is EBay. You should reasonably expect to find a rebuilt 700R4 with the TV cable, a torque converter, and rebuilt insides for right around $600.&nbsp; You can find one that can handle at least 500 horsepower for right around the $1000 price point.&nbsp; Amazon is another great place to look.&nbsp; They have them at similar prices, and if you happen to be a member of their fantastic prime service you can save a ton of money in shipping<\/li>\n<\/ul>\n<ul>\n<li><strong>Disadvantages:&nbsp;<\/strong>&nbsp;Be wary of some sellers on eBay that charge you a core fee.&nbsp; There is absolutely no reason to do this.&nbsp; It is just a way to make the pricing look more appealing.&nbsp; Often, people don’t notice this and get a bad deal.&nbsp;&nbsp; It’s more expensive, but if you can it’s great to have a transmission that you know is going to stand the test of time.<\/li>\n<\/ul>\n<p>No matter where you decide to get a 700R4 Transmission from, the more research you do the more money you will save.<\/p>\n<p>&nbsp;<br \/>\n<a href=\"https:\/\/mlabs.info\/about-me\/terms-of-service-and-privacy\/\">Privacy Policy<\/a><br \/>\n&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The TH700R4 transmission was designed to replace the&nbsp;TH350 transmission. &nbsp;It is a GM automatic transmission designed for rear wheel drive vehicles. &nbsp;GM was feeling the pressure to produce more fuel efficient cars from both the government and consumers, the latter&nbsp;were just starting to discover the reliability and fuel savings that Japanese auto makers were offering. &#8230; <a title=\"700R4\" class=\"read-more\" href=\"https:\/\/mlabs.info\/\" aria-label=\"More on 700R4\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":1,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/pages\/11"}],"collection":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/comments?post=11"}],"version-history":[{"count":0,"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/pages\/11\/revisions"}],"wp:attachment":[{"href":"https:\/\/mlabs.info\/wp-json\/wp\/v2\/media?parent=11"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}